# ðŸ’¡ Exploratory Data Analysis ðŸ’¡

Data taken from: https://www.kaggle.com/gustavomodelli/forest-fires-in-brazil/downloads/forest-fires-in-brazil.zip/1

## ðŸ¤” Consider visualizing the following

* Multiple states overlaid on top of one another in **time series analysis**
    * **X-axis**: time
        * *month* è¿˜æ˜¯ *year*? -- *omg **YEAR** as main, with **MONTH** as drilldown option*!
        * **In this EDA**, use *everything* to plot time series; **in deployal**, plot by _overall fires in the year_, then _drilldown to month-by-month_
    * **y-axis**: # of fires
    * **z-axis**: specific Brazilian state
* ***Cumulative*** fires in all of Brazil as a **bar chart**
    * **X-axis**: year (_again, with MONTH as a drilldown option_)
    * **y-axis**: total # of fires across all months and all regions

In [25]:
ls

amazon.csv*                 forest-fires-in-brazil.zip

In [5]:
from scipy import stats
import math
import csv
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [33]:
df = pd.read_csv("amazon.csv", encoding= 'ISO-8859-1')
df.head(10)

   year state    month  number        date
0  1998  Acre  Janeiro     0.0  1998-01-01
1  1999  Acre  Janeiro     0.0  1999-01-01
2  2000  Acre  Janeiro     0.0  2000-01-01
3  2001  Acre  Janeiro     0.0  2001-01-01
4  2002  Acre  Janeiro     0.0  2002-01-01
5  2003  Acre  Janeiro    10.0  2003-01-01
6  2004  Acre  Janeiro     0.0  2004-01-01
7  2005  Acre  Janeiro    12.0  2005-01-01
8  2006  Acre  Janeiro     4.0  2006-01-01
9  2007  Acre  Janeiro     0.0  2007-01-01

In [22]:
df['year'].unique()

array([1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008,
       2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017])

In [24]:
df['state'].unique().tolist()

['Acre',
 'Alagoas',
 'Amapa',
 'Amazonas',
 'Bahia',
 'Ceara',
 'Distrito Federal',
 'Espirito Santo',
 'Goias',
 'Maranhao',
 'Mato Grosso',
 'Minas Gerais',
 'ParÃ¡',
 'Paraiba',
 'Pernambuco',
 'Piau',
 'Rio',
 'Rondonia',
 'Roraima',
 'Santa Catarina',
 'Sao Paulo',
 'Sergipe',
 'Tocantins']

In [28]:
df['number'].dtype

dtype('float64')

In [34]:
df['date'].dtype

dtype('O')

In [35]:
df['date'] = pd.to_datetime(df['date'])
df.sort_values(by='date').head()

      year        state     month  number       date
0     1998         Acre   Janeiro     0.0 1998-01-01
6415  1998    Tocantins  Novembro     1.0 1998-01-01
2790  1998  Mato Grosso  Setembro   457.0 1998-01-01
2810  1998  Mato Grosso   Outubro   576.0 1998-01-01
2830  1998  Mato Grosso  Novembro   306.0 1998-01-01

In [36]:
df['date'].dtype

dtype('<M8[ns]')

# TODO: Write a function that takes month + year and smashes 'em into a date that actually represents the month + year